const { changePrice, changeDeadline } = require('./countingFunctions');

describe('changePrice', () => {
    test.each`
    lettersCount |  language    | result
    ${100}       |  ${"ukr"}    | ${50}
    ${1000}      |  ${"ukr"}    | ${50}
    ${5000}      |  ${"ukr"}    | ${250}
    ${20000}     |  ${"ukr"}    | ${1000}
    ${100}       |  ${"ru"}     | ${50}
    ${1000}      |  ${"ru"}     | ${50}
    ${5000}      |  ${"ru"}     | ${250}
    ${20000}     |  ${"ru"}     | ${1000}
    ${100}       |  ${"eng"}    | ${120}
    ${1000}      |  ${"eng"}    | ${120}
    ${5000}      |  ${"eng"}    | ${600}
    ${20000}     |  ${"eng"}    | ${2400}
    `('changePrice__table', ({ lettersCount, language, result }) => {
        expect(changePrice(lettersCount, language)).toBe(result);
    });
});

describe('changeDeadline', () => {
    test.each`
    lettersCount |  language    | date                          | result
    ${100}       |  ${"ukr"}    | ${'Tue Sep 29 2020 8:00:00'}  | ${'Термін виконання: 29.09.2020 o 11:00'}
    ${100}       |  ${"ukr"}    | ${'Tue Sep 29 2020 11:00:00'} | ${'Здамо за: одну годину'}
    ${100}       |  ${"ukr"}    | ${'Tue Sep 29 2020 19:00:00'} | ${'Термін виконання: 30.09.2020 o 11:00'}
    ${1333}      |  ${"ukr"}    | ${'Fri Sep 25 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${1333}      |  ${"ukr"}    | ${'Sat Sep 26 2020 10:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${1333}      |  ${"ukr"}    | ${'Sun Sep 27 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${2666}      |  ${"ukr"}    | ${'Fri Sep 25 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 12:30'}
    ${6665}      |  ${"ukr"}    | ${'Sat Sep 26 2020 10:00:00'} | ${'Термін виконання: 28.09.2020 o 15:30'}
    ${13330}     |  ${"ukr"}    | ${'Sun Sep 27 2020 19:00:00'} | ${'Термін виконання: 29.09.2020 o 11:30'}
    ${26660}     |  ${"ukr"}    | ${'Tue Sep 29 2020 16:59:00'} | ${'Термін виконання: 02.10.2020 o 10:30'}
    ${100}       |  ${"ru"}     | ${'Tue Sep 29 2020 8:00:00'}  | ${'Термін виконання: 29.09.2020 o 11:00'}
    ${100}       |  ${"ru"}     | ${'Tue Sep 29 2020 11:00:00'} | ${'Здамо за: одну годину'}
    ${100}       |  ${"ru"}     | ${'Tue Sep 29 2020 19:00:00'} | ${'Термін виконання: 30.09.2020 o 11:00'}
    ${1333}      |  ${"ru"}     | ${'Fri Sep 25 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${1333}      |  ${"ru"}     | ${'Sat Sep 26 2020 10:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${1333}      |  ${"ru"}     | ${'Sun Sep 27 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${2666}      |  ${"ru"}     | ${'Fri Sep 25 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 12:30'}
    ${6665}      |  ${"ru"}     | ${'Sat Sep 26 2020 10:00:00'} | ${'Термін виконання: 28.09.2020 o 15:30'}
    ${13330}     |  ${"ru"}     | ${'Sun Sep 27 2020 19:00:00'} | ${'Термін виконання: 29.09.2020 o 11:30'}
    ${26660}     |  ${"ru"}     | ${'Tue Sep 29 2020 16:59:00'} | ${'Термін виконання: 02.10.2020 o 10:30'}
    ${100}       |  ${"eng"}    | ${'Tue Sep 29 2020 8:00:00'}  | ${'Термін виконання: 29.09.2020 o 11:00'}
    ${100}       |  ${"eng"}    | ${'Tue Sep 29 2020 11:00:00'} | ${'Здамо за: одну годину'}
    ${100}       |  ${"eng"}    | ${'Tue Sep 29 2020 19:00:00'} | ${'Термін виконання: 30.09.2020 o 11:00'}
    ${333}       |  ${"eng"}    | ${'Fri Sep 25 2020 15:00:00'} | ${'Здамо за: дві години'}
    ${333}       |  ${"eng"}    | ${'Sat Sep 26 2020 10:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${333}       |  ${"eng"}    | ${'Sun Sep 27 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 11:30'}
    ${666}       |  ${"eng"}    | ${'Fri Sep 25 2020 19:00:00'} | ${'Термін виконання: 28.09.2020 o 12:30'}
    ${3330}      |  ${"eng"}    | ${'Sat Sep 26 2020 10:00:00'} | ${'Термін виконання: 29.09.2020 o 11:30'}
    ${6660}      |  ${"eng"}    | ${'Sun Sep 27 2020 19:00:00'} | ${'Термін виконання: 30.09.2020 o 12:30'}
    ${6660}      |  ${"eng"}    | ${'Tue Sep 29 2020 19:00:00'} | ${'Термін виконання: 02.10.2020 o 12:30'}
    `('changeDeadline__table', ({ lettersCount, language, date, result }) => {
        expect(changeDeadline(lettersCount, language, date)).toBe(result);
    });
});